{
  "trips": [
    {
      "id": 1,
      "name": "Grand Canyon National Park",
      "image": "https://images.unsplash.com/photo-1501785888041-af3ef285b470",
      "description": "Vast red rock canyon carved by the Colorado River.",
      "long_description": "Stretching 277 miles long and over a mile deep, the Grand Canyon reveals nearly two billion years of Earth's history through its colorful layers of rock. Visitors can hike, raft, or simply take in the breathtaking views from the rim, watching the light shift across the canyon walls throughout the day.",
      "rating": 5
    },
    {
      "id": 2,
      "name": "Carhenge",
      "image": "https://images.unsplash.com/photo-1500530855697-b586d89ba3ee",
      "description": "Stonehenge replica made entirely from vintage cars.",
      "long_description": "Located near Alliance, Nebraska, Carhenge recreates the famous English monument using 38 old automobiles painted gray and arranged in the same proportions as the original. It’s a quirky celebration of both art and Americana that attracts thousands of visitors each year.",
      "rating": 4
    },
    {
      "id": 3,
      "name": "Joshua Tree National Park",
      "image": "https://images.unsplash.com/photo-1519681393784-d120267933ba",
      "description": "Iconic desert park known for its unique Joshua trees.",
      "long_description": "Where the Mojave and Colorado deserts meet, Joshua Tree National Park is a land of rugged rock formations and stark desert beauty. Named for its spiky, twisted trees, the park offers world-class climbing, stargazing, and the kind of silence that’s hard to find anywhere else.",
      "rating": 5
    },
    {
      "id": 4,
      "name": "World’s Largest Ball of Twine",
      "image": "https://images.unsplash.com/photo-1506744038136-46273834b3fb",
      "description": "A roadside legend in Cawker City, Kansas.",
      "long_description": "Started by a single resident in 1953, this enormous ball of sisal twine has been growing ever since, thanks to contributions from locals and travelers alike. It stands as a living monument to small-town pride, oddity, and community spirit.",
      "rating": 3
    },
    {
      "id": 5,
      "name": "Mount Rushmore",
      "image": "https://images.unsplash.com/photo-1586974772928-9e4d0efcc9ab",
      "description": "Famous presidential monument carved into granite.",
      "long_description": "Sculpted into the Black Hills of South Dakota, Mount Rushmore features the faces of Washington, Jefferson, Roosevelt, and Lincoln. The monument took 14 years to complete and stands as a tribute to the nation’s founding, growth, and preservation.",
      "rating": 4
    },
    {
      "id": 6,
      "name": "Salvation Mountain",
      "image": "https://images.unsplash.com/photo-1570129477492-45c003edd2be",
      "description": "A technicolor art installation in the desert.",
      "long_description": "Created by artist Leonard Knight, Salvation Mountain is a massive, hand-built monument proclaiming love and faith through bright paint, adobe, and straw. Its kaleidoscope colors and handmade details make it one of California’s most photographed outsider art sites.",
      "rating": 5
    },
    {
      "id": 7,
      "name": "Antelope Canyon",
      "image": "https://images.unsplash.com/photo-1501594907352-04cda38ebc29",
      "description": "A sandstone slot canyon of swirling colors.",
      "long_description": "Carved by centuries of flash flooding, Antelope Canyon in Arizona is a masterpiece of nature’s sculpting. Light beams filter through narrow openings, illuminating the orange and purple waves of sandstone, creating an otherworldly atmosphere beloved by photographers.",
      "rating": 5
    },
    {
      "id": 8,
      "name": "Cadillac Ranch",
      "image": "https://images.unsplash.com/photo-1614463161951-c33c6bdb2d58",
      "description": "Ten Cadillacs buried nose-first in the Texas desert.",
      "long_description": "A public art installation outside Amarillo, Cadillac Ranch was created in 1974 by a group called Ant Farm. The half-buried cars span the evolution of the Cadillac tailfin, and visitors are encouraged to add their own spray-painted art, keeping the exhibit ever-changing.",
      "rating": 4
    },
    {
      "id": 9,
      "name": "Devils Tower",
      "image": "https://images.unsplash.com/photo-1536334720751-0e4a3f2b7a0e",
      "description": "Towering volcanic monolith in Wyoming.",
      "long_description": "Rising dramatically from the plains of Wyoming, Devils Tower is a striking natural formation revered by Native American tribes and known as the nation’s first national monument. Its fluted columns are a favorite among climbers and photographers alike.",
      "rating": 5
    },
    {
      "id": 10,
      "name": "Roswell UFO Museum",
      "image": "https://images.unsplash.com/photo-1526498460520-4c246339dccb",
      "description": "Dive into UFO lore and alien encounters.",
      "long_description": "The International UFO Museum in Roswell, New Mexico explores the mystery of the alleged 1947 UFO crash. Packed with exhibits, photos, and first-hand accounts, it’s a pilgrimage site for believers, skeptics, and pop-culture enthusiasts alike.",
      "rating": 3
    },
    {
      "id": 11,
      "name": "Niagara Falls",
      "image": "https://images.unsplash.com/photo-1506744038136-46273834b3fb",
      "description": "World-famous waterfalls between the US and Canada.",
      "long_description": "Niagara Falls’ massive cascades send over 3,000 tons of water per second tumbling down its cliffs. Visitors can view the spectacle from both sides of the border, take a boat into the mist, or marvel at nighttime light shows and fireworks.",
      "rating": 5
    },
    {
      "id": 12,
      "name": "Bonneville Salt Flats",
      "image": "https://images.unsplash.com/photo-1500534314209-a25ddb2bd429",
      "description": "Utah’s surreal expanse of pure white salt.",
      "long_description": "A remnant of ancient Lake Bonneville, these vast flats stretch for miles and create a mirror-like effect after rain. They serve as a natural racetrack for land speed records and a photographer’s dream for minimalist landscapes.",
      "rating": 4
    },
    {
      "id": 13,
      "name": "Crater Lake National Park",
      "image": "https://images.unsplash.com/photo-1570129477492-45c003edd2be",
      "description": "A deep volcanic lake with brilliant blue water.",
      "long_description": "Formed nearly 8,000 years ago by the collapse of Mount Mazama, Oregon’s Crater Lake is the deepest in the United States. Its pristine waters and steep surrounding cliffs make it one of the most spectacular natural sights in the Pacific Northwest.",
      "rating": 5
    },
    {
      "id": 14,
      "name": "Mystery Spot",
      "image": "https://images.unsplash.com/photo-1587502537745-84b80b1f3f19",
      "description": "Optical illusion attraction in Santa Cruz.",
      "long_description": "Since the 1940s, the Mystery Spot has baffled visitors with tilted rooms and gravity-defying effects. Whether a trick of perspective or something stranger, it remains one of California’s most enduring roadside curiosities.",
      "rating": 4
    },
    {
      "id": 15,
      "name": "Sequoia National Park",
      "image": "https://images.unsplash.com/photo-1503264116251-35a269479413",
      "description": "Home of the world’s largest trees.",
      "long_description": "California’s Sequoia National Park shelters the giant sequoias — ancient trees that can live over 3,000 years and tower more than 250 feet high. The General Sherman Tree, the world’s largest by volume, inspires awe in all who stand beneath it.",
      "rating": 5
    },
    {
      "id": 16,
      "name": "South of the Border",
      "image": "https://images.unsplash.com/photo-1596484557299-8fc5d9aa66e9",
      "description": "Neon roadside landmark along I-95.",
      "long_description": "Straddling the North Carolina–South Carolina line, South of the Border has been luring travelers for decades with its colorful billboards, giant sombrero tower, and kitschy charm. It’s equal parts nostalgic tourist trap and road trip rite of passage.",
      "rating": 3
    },
    {
      "id": 17,
      "name": "Bryce Canyon National Park",
      "image": "https://images.unsplash.com/photo-1500530855697-b586d89ba3ee",
      "description": "Maze of crimson spires called hoodoos.",
      "long_description": "Bryce Canyon’s amphitheaters of red and orange rock formations glow vividly at sunrise. Its high-elevation trails weave among whimsical pillars carved by frost and erosion, offering one of the most surreal landscapes in the American West.",
      "rating": 5
    },
    {
      "id": 18,
      "name": "Route 66 Museum",
      "image": "https://images.unsplash.com/photo-1530789253388-582c481c54b0",
      "description": "Celebrating America’s historic highway.",
      "long_description": "Located in Oklahoma, this museum traces the cultural legacy of Route 66 — the ‘Mother Road’ that connected Chicago to Los Angeles. Through vintage cars, neon signs, and personal stories, it captures the romance of mid-century American travel.",
      "rating": 4
    },
    {
      "id": 19,
      "name": "Arches National Park",
      "image": "https://images.unsplash.com/photo-1501785888041-af3ef285b470",
      "description": "Landscape filled with over 2,000 natural arches.",
      "long_description": "Arches National Park, in Utah’s red rock country, is a wonderland of delicate sandstone arches, spires, and fins. Sunrise and sunset turn the formations fiery red, creating unforgettable views and endless opportunities for exploration.",
      "rating": 5
    },
    {
      "id": 20,
      "name": "The Wave, Arizona",
      "image": "https://images.unsplash.com/photo-1518837695005-2083093ee35b",
      "description": "Famous swirling rock formation near the Utah border.",
      "long_description": "Hidden within the Paria Canyon–Vermilion Cliffs Wilderness, The Wave is a geological masterpiece of undulating sandstone. Its surreal patterns and vivid stripes draw photographers from around the world — though only a handful of daily visitors are permitted via lottery.",
      "rating": 5
    }
  ]
}
